namespace ブラウザ操作日本語化;

/// <summary>
/// 各フォーム要素の基底クラス
/// </summary>
public class フォーム要素
{
    public readonly 画面要素インターフェース インターフェース;

    public フォーム要素(画面要素インターフェース インターフェース)
    {
        this.インターフェース = インターフェース;
    }

    
    // public void クリックする()
    // {
    //     インターフェース.クリックする();
    // }

    // public string テキスト
    // {
    //     get { return インターフェース.テキスト; }
    // }

    // public void テキストを入力する(string テキスト)
    // {
    //     インターフェース.クリアする();
    //     インターフェース.キー入力を送る(テキスト);
    // }

    // public string? テキストを取得する()
    // {
    //     return インターフェース.属性を取得する("value");
    // }

    // public bool 選択されている => インターフェース.選択されている;

    // public IList<Web要素> 全ての選択肢()
    // {
    //     return インターフェース.選択肢のリスト();
    // }
    // public Web要素 選択された選択肢 => インターフェース.選択された選択肢;

    // public IList<Web要素> 全ての選択された選択肢()
    // {
    //     return インターフェース.全ての選択された選択肢();
    // }
    // public bool IsMultiple => インターフェース.複数選択可能;
    // public void テキストで選択する(string テキスト)
    // {
    //     インターフェース.テキストで選択する(テキスト);
    // }
    // public void 値で選択する(string 値)
    // {
    //     インターフェース.値で選択する(値);
    // }
    // public void 順番で選択する(int 順番)
    // {
    //     インターフェース.順番で選択する(順番);
    // }
    // public Web要素 ラップされた要素 => インターフェース.ラップされた要素;
    // public void 全て選択解除する()
    // {
    //     インターフェース.全て選択解除する();
    // }
}